districts = {
    "Центральный": {
        'белгород': (50.595414, 36.587277),
        'брянск': (53.243400, 34.363991),
        'воронеж': (51.660781, 39.200296),
        'иваново': (56.999799, 40.973014),
        'калуга': (54.513678, 36.261341),
        'кострома': (57.767918, 40.926894),
        'липецк': (52.608826, 39.599229),
        'красногорск': (55.820369, 37.319484),
        'ярославль': (57.626559, 39.893813),
        'тула': (54.193122, 37.617348),
        'тамбов': (52.721295, 41.452750),
        'тверь': (56.858745, 35.917421),
        'владимир': (56.134710, 40.406599),
        'москва': (55.755508, 37.617187),
        'орел': (52.970756, 36.064358),
        'рязань': (54.629221, 39.737111),
        'смоленск': (54.778263, 32.051054)
    },
    'Северо-Западный': {
        'петрозаводск': (61.785021, 34.346878),
        'сывтывкар': (61.668797, 50.836497),
        'псков': (57.819307, 28.332792),
        'санкт-петербург': (59.938784, 30.314997),
        "медвежьегорск": (62.914998, 34.473101),
        'мурманск': (68.964319, 33.048633),
        'архангельск': (64.539911, 40.515762),
        'вологда': (59.220501, 39.891523),
        'великий новгород': (58.522857, 31.269816),
        'калининград': (54.710162, 20.510137),
        'нарьян-мар': (67.638050, 53.006926)
    },
    'Южный': {
        'астрахань': (46.347614, 48.030178),
        'волгоград': (48.707067, 44.516975),
        'черкесск': (44.228374, 42.048279),
        'ростов-на-дону': (47.222109, 39.718813),
        'краснодар': (45.035470, 38.975313),
        'элиста': (46.307743, 44.269759),
        'ставрополь': (45.043317, 41.969110)
    },
    'Северо-Кавказский':{
        'черкесск': (44.228374, 42.048279),
        'нальчик': (43.485259, 43.607081),
        'махачкала': (42.983100, 47.504745),
        'владикавказ': (43.024616, 44.681771),
        'магас': (43.166787, 44.803574),
        'донецк': (48.015884, 37.802850),
        'симферополь': (44.948237, 34.100327),
        'луганск': (48.573896, 39.307708),
        'майкоп': (44.606683, 40.105852),
        'грозный': (43.318366, 45.692421),
        'севастополь': (44.616020, 33.5244710)
    },
    'Приволжский': {
        'оренбург': (51.768205, 55.097000),
        'пенза': (53.195042, 45.018316),
        'самара': (53.195878, 50.10020),
        'екатеринбург': (56.837435, 60.597636),
        'нижний новгород': (56.326797, 44.006516),
        'казань': (55.796127, 49.106414),
        'пермь': (58.010543, 56.250170),
        'уфа': (54.735152, 55.958736),
        'йошкар-ола': (56.631600, 47.886178),
        'саранск': (54.187433, 45.183938),
        'ижевск': (56.845096, 53.188089),
        'чебоксары':(56.139918, 47.247728),
        'ульяновск': (54.318598, 48.405773),
        'саратов': (51.533338, 46.034176),
        'киров': (58.603595, 49.668023)
    },
    'Уральский': {
        'екатеринбург': (56.837435, 60.597636),
        'ханты-мансийск': (61.003184, 69.018911),
        'новосибирск': (58.522857, 31.269816),
        'омск': (54.989347, 73.368221),
        'салехард': (66.529866, 66.614507),
        'челябинск': (55.159902, 61.402554)


    },
    'Сибирский': {
        'томск': (56.484645, 84.947649),
        'абакан': (53.721152, 91.442396),
        'красноярск': (56.010543, 92.852581),
        'улан-удэ': (51.834809, 107.584547),
        'горно-алтайск': (51.957804, 85.960634),
        'кызыл': (51.719890, 94.437990),
        'барнаул': (53.346785, 83.776856) ,
        'чита': (52.033635, 113.501049),
        'иркутск': (52.289588, 104.280606),
        'кемерово': (55.355198, 86.086847)
    },
    'Дальновосточный': {
        'петропавловск-камчатский': (53.024265, 158.643503),
        'якутск': (62.027221, 129.732178),
        'владивосток': (43.115542, 131.885494),
        'биробиджан': (48.789920, 132.924746),
        'анадырь': (64.735814, 177.518913),
        'благовещенск': (50.249266, 127.553278),
        'хабаровск': (48.480229, 135.071917),
        'южно-сахалинск': (46.957771, 142.729587),
        'магадан': (59.565155, 150.808586)



    }
}
import requests
from datetime import datetime

def get_weather(lat,lon):


  url = f'https://api.open-meteo.com/v1/forecast?latitude={lat}&longitude={lon}&current_weather=true'
  try:

    r = requests.get(url, timeout=5)
    r.raise_for_status()
    data = r.json()
    return {
        'temp': data['current_weather']['temperature'],
        'wind': data['current_weather']['windspeed']
    }
  except:
     return None
def save_to_log(city, temp, wind):
  timestamp = datetime.now().strftime('%Y-%m-%d-%H:%M')
  with open('weather_log.txt','a', encoding = 'utf-8') as f:
    f.write(f'[{timestamp}] {city.capitalize()}: {temp}°C, ветер {wind} м/с\n')

print('Выберите федеральный округ:')
for i, district in enumerate(districts.keys(),1):
  cities = ', '.join([c.capitalize() for c in districts[district]])
  print(f'{i}. {district} → [{cities}]')

try:
  choice = int(input('\nНомер округа: ')) - 1
  selected_district = list(districts.keys())[choice]
  cities = districts[selected_district]

  print(f'\nГорода в {selected_district}:')
  for i, city in enumerate(cities.keys(), 1):
    print(f'{i}. {city.capitalize()}')

  city_choice = int(input("\nНомер города:")) - 1
  city_name = list(cities.keys())[city_choice]

  lat, lon = cities[city_name]
  weather = get_weather(lat, lon)

  if weather:
    print(f'\n ⛅ Погода в {city_name.capitalize()}:')
    print(f'  Температура: {weather['temp']}°C')
    print(f'  💨 Ветер: {weather['wind']} м/с')


    save_to_log(city_name, weather['temp'], weather['wind'])
    print('\nЗапрос сохранён в history.txt')
  else:
    print(' Не удалось получить погоду.')

except (ValueError, IndexError, KeyError):
  print(' Некорректный ввод.')